import { ISelfIntroduction } from "interface/ISelfIntroduction";

export const selfIntroduction: ISelfIntroduction.Payload[] = [
  {
    title: "개발 전환 계기",
    detail: `
  SF 소설을 읽으면서 인공지능, 빅데이터 등의 4차 산업혁명과 프로그래밍에 호기심이 생겼습니다. 그러던 차에 국비지원 ICT 교육을 발견해 지원했습니다. 비전공자로서 어려움을 예상했던 담당자들의 우려와는 달리, 로직을 고민하며 코드를 적어 내려가는 과정에 금세 적응했습니다. 기능을 구현하거나 문제를 맞딱뜨렸을 때, 고민하는 과정과 해결하는 순간이 좋아 개발 공부를 이어가기로 결심했습니다. 교육 내 프로젝트에서 웹을 구현하면서 웹 개발에 재미를 느꼈습니다. 그 후부터 지금까지 프론트엔드 공부를 계속하고 있습니다.
  `,
  },
  {
    title: "성격",
    detail: `
  논리정연합니다. 근거 없이 주장하거나 글을 쓰지 않습니다. 저보다 상대방이 더 논리적이라면 수용합니다.

배려합니다. 상대방 입장에서 한 번 더 생각하고 행동합니다. 다만, 이기적인 요구까지 배려하지는 않습니다.

신중합니다. 해결책이 필요한 안건을 접했을 때, 가볍게 판단하지 않고 최대한 정보를 수집한 후 결정합니다. 제 능력 밖의 일이라면, 전문가에게 조언을 얻어 판단합니다. 그렇다고 우유부단하게 결정을 미루지 않습니다.
  `,
  },
  {
    title: "취미 및 특기",
    detail: `
    요리 : 레시피는 참고하되, 재료나 양념 등은 재량으로 선택해 조리하는 것을 좋아합니다.

걷기 : 걸으면서 주변 풍경을 관찰하거나 상념에 잠기는 것을 좋아합니다. 매일 1만 보씩 걷고 있습니다.

글쓰기 : 주제와 요구사항이 주어지면 분야에 상관없이 그에 걸맞은 글을 능숙하게 작성할 수 있습니다.
    `,
  },
  {
    title: "자기 계발",
    detail: `
    꾸준한 성장을 지향합니다. '노마드 코더', '인프런' 등의 강의와 여러 서적을 통해 공부하고, 새로 배운 내용은 정리하여 블로그에 기록합니다. 흥미로운 기술이 있다면 직접 웹 서비스를 만들어 가며 익힙니다.

자기 계발을 지속하기 위해 매일을 기록합니다. 다이어리에 시간대 별로 한 일을 기록하고, 하루를 마무리하기 전 블로그에 정리하며 반성합니다.

지금에 안주해 있지 않고, 어제보다 오늘, 오늘보다 내일 더 성장하는 개발자가 되겠습니다.
    `,
  },
  {
    title: "입사 후 포부",
    detail: `
    먼저 하루빨리 주니어를 벗어나 언제든 필요한 기술을 빨리 적용할 수 있도록 노력하겠습니다. 최신 트렌드 관찰, 독서, 공부 등을 멈추지 않겠습니다.

미드 개발자 단계에서는 역량을 강화함과 동시에 후임들을 끌어올려 양질의 코드를 작성하는 개발 문화를 형성하고 싶습니다.

시니어 개발자가 되어서도 프로그래밍의 최전선에서 뛰는 것이 궁극적인 목표입니다. 더 나은 프로그램을 만들어 훌륭한 개발자로 이름을 남기고 싶습니다.

프로그래밍은 언제나 더 나은 방향이 있다고 생각합니다. 지속해서 로직을 개선하고, 언제나, 누구든 이해할 수 있는 코드를 작성하는 개발자가 되겠습니다. 어느 한순간도 타협이나 회피가 아닌 개발 트렌드 최전선에서 뛰는 개발자로 남도록 전력을 다하겠습니다.
    `,
  },
];
